tests/performance/backend_results.txt
Running 30s test @ http://127.0.0.1:3001/api/users
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.51ms  284.49us   3.40ms   88.51%
    Req/Sec     7.53k   162.57     8.18k    68.42%
  Latency Distribution
     50%    1.54ms
     75%    1.65ms
     90%    1.75ms
     99%    1.95ms
  1799582 requests in 30.04s, 344.88MB read
Requests/sec:  59911.88
Transfer/sec:     11.48MB

--- Backend Baseline Statistics ---
Total requests: 1799582
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0