tests/performance/health_results.txt
Running 30s test @ http://127.0.0.1:8000/health
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms  349.72us  41.05ms   80.18%
    Req/Sec    12.13k   485.96    13.92k    78.69%
  Latency Distribution
     50%    0.96ms
     75%    1.16ms
     90%    1.35ms
     99%    1.84ms
  2905090 requests in 30.10s, 451.59MB read
Requests/sec:  96512.15
Transfer/sec:     15.00MB

--- Health Check Statistics ---
Total requests: 2905090
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0