tests/performance/users_results.txt
Running 30s test @ http://127.0.0.1:8000/api/users
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms  578.98us  12.69ms   66.59%
    Req/Sec     9.68k   562.32    10.96k    68.98%
  Latency Distribution
     50%    1.17ms
     75%    1.65ms
     90%    2.00ms
     99%    2.83ms
  2318265 requests in 30.10s, 361.47MB read
Requests/sec:  77010.35
Transfer/sec:     12.01MB

--- Users API Statistics ---
Total requests: 2318265
Non-2xx responses: 0
Socket errors: connect 0, read 0, write 0, timeout 0